Revit 2027 API
TableSectionData.CanRemoveColumn Method
 Verifies that if the column at the given index can be removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanRemoveColumn(
	int nIndex
)
Public Function CanRemoveColumn (
	nIndex As Integer
) As Boolean
public:
bool CanRemoveColumn(
	int nIndex
)
member CanRemoveColumn :
        nIndex : int -> bool
Parameters
nIndex Int32
 An integer index.
Return Value
Boolean
 True if the column can be removed, false otherwise.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace